
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/12075798129)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 5 to change, 2 to destroy.</code></pre>

* Create
  * aws_s3_bucket_object.demo_page
  * aws_s3_bucket_object.index_page
  * local_file.demo_page
  * local_file.index_page
* Update
  * aws_dynamodb_table.Link_table
  * aws_lambda_function.lambda
  * aws_lambda_function.scan
  * aws_s3_bucket.images
  * aws_s3_bucket.website
* Delete
  * aws_s3_bucket_object.example_file
* Replace
  * aws_lambda_layer_version.test_lambda_layer


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
      ~ billing_mode     = "PROVISIONED" -> "PAY_PER_REQUEST"
        id               = "mtchoun-mouh-snyk-fix-werkzeug-Link_table"
        name             = "mtchoun-mouh-snyk-fix-werkzeug-Link_table"
      ~ read_capacity    = 1 -> 3
        tags             = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-snyk-fix-werkzeug-user_registration_consulcam"
      ~ last_modified                  = "2024-09-30T19:53:34.178+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw=" -> "otjxhkmYsItml++V4smRv3rYS0aVLmDqtbuWboPiD7U="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "mtchoun-mouh-snyk-fix-werkzeug-scan_user_consulcam"
      ~ last_modified                  = "2024-09-30T19:53:26.087+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ source_code_hash               = "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw=" -> "otjxhkmYsItml++V4smRv3rYS0aVLmDqtbuWboPiD7U="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "test_lambda_layer" {
      ~ arn                         = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:9" -> (known after apply)
      ~ compatible_runtimes         = [ # forces replacement
          - "python3.7",
            # (1 unchanged element hidden)
        ]
      ~ created_date                = "2024-09-30T19:53:33.245+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:9" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "NsnlzdZ4NJjNKk1nhrd2feHtdLYiD6ukJI6lnxTeu5k=" -> (known after apply)
      ~ source_code_size            = 29499558 -> (known after apply)
      ~ version                     = "9" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-snyk-fix-werkzeug-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (13 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.demo_page will be created
  + resource "aws_s3_bucket_object" "demo_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "demo.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/demo.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.example_file will be destroyed
  # (because aws_s3_bucket_object.example_file is not in configuration)
  - resource "aws_s3_bucket_object" "example_file" {
      - acl                           = "private" -> null
      - bucket                        = "mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/html" -> null
      - etag                          = "8ffa4eaa921c0a6f4b408e436edc5079" -> null
      - force_destroy                 = false -> null
      - id                            = "index.html" -> null
      - key                           = "index.html" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../html/index.html" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (9 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.index_page will be created
  + resource "aws_s3_bucket_object" "index_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 5 to add, 5 to change, 2 to destroy.

```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":198,"Program":"tfcmt","SHA1":"aa13e8e31f783882891e529c66a7f662d07d3eeb","Vars":{},"WorkflowName":"Deploy cases"} -->